In [2]:
### craete a connection between workbench and jupyter notebook

import mysql.connector as sql
connection= sql.connect(
    host="localhost",
    port='3306',
    user='root',
    password='root',
    database='studentdb')

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001DA5E681940>

In [3]:
import pandas as pd
df=pd.read_sql_query('select * from student',connection)
df

   student_id    name             email
0        1001   abhik   abhik@gmail.com
1        1002  raghav  raghav@gmail.com
2        1003   rahul   rahul@yahoo.com
3        1004  shital  shital@yahoo.com
4        1005   kiran   kiran@yahoo.com
5        1006   megha   megha@gmail.com

In [4]:
df1=pd.read_sql_query('select * from department',connection)
df1

   dep_id    dep_name dep_code
0    5001       civil     cv05
1    5002  mechanical     me06
2    5003  electrical     ec07
3    5004         csc     cs08
4    5005    humanity     hu09
5    5006         bio     bi04

- separate email adresss from student table applying pandas function

In [9]:
# separate mail domain

df['separate domain']=df['email'].apply(lambda x: x.split('@')[1])
df

   student_id    name             email separate domain
0        1001   abhik   abhik@gmail.com       gmail.com
1        1002  raghav  raghav@gmail.com       gmail.com
2        1003   rahul   rahul@yahoo.com       yahoo.com
3        1004  shital  shital@yahoo.com       yahoo.com
4        1005   kiran   kiran@yahoo.com       yahoo.com
5        1006   megha   megha@gmail.com       gmail.com